riyasach189/ESD-2024-Project/stm32-lsr/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define LED_GREEN_Pin GPIO_PIN_5
#define LED_GREEN_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define motorRight2_Pin GPIO_PIN_2
#define motorRight2_GPIO_Port GPIOD
#define motorRight1_Pin GPIO_PIN_3
#define motorRight1_GPIO_Port GPIOD
#define motorLeft2_Pin GPIO_PIN_4
#define motorLeft2_GPIO_Port GPIOD
#define motorLeft1_Pin GPIO_PIN_5
#define motorLeft1_GPIO_Port GPIOD
#define trigRight_Pin GPIO_PIN_4
#define trigRight_GPIO_Port GPIOB
#define echoRight_Pin GPIO_PIN_5
#define echoRight_GPIO_Port GPIOB
#define trigStraight_Pin GPIO_PIN_6
#define trigStraight_GPIO_Port GPIOB
#define echoStraight_Pin GPIO_PIN_7
#define echoStraight_GPIO_Port GPIOB
#define trigLeft_Pin GPIO_PIN_8
#define trigLeft_GPIO_Port GPIOB
#define echoLeft_Pin GPIO_PIN_9
#define echoLeft_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
